app/controllers/blog_posts_controller.rb

    def index
        @blogposts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

    def create
        # byebug
        user = User.find(params[:user_id])
        @blogpost = BlogPost.create(
            # blog_post_params
            title: params[:title],
            content: params[:content],
            user: user
        )
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "blog_posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdgasg"], ["content", "asdgasgsg"], ["created_at", "2020-12-01 00:01:40.801456"], ["updated_at", "2020-12-01 00:01:40.801456"], ["user_id", 1]]

    def update
        # user = User.find(params[:id])
        @blogpost = BlogPost.find(params[:id])
        if @blogpost
            @blogpost.update(
                title: params[:title],
                content: params[:content],
            )
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "blog_posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "blog_posts"."id" = $4  [["title", "Confessions from a Serial Dater"], ["content", "sdljasld;gjw;aljsd "], ["updated_at", "2020-12-01 08:32:46.092476"], ["id", 2]]

    def destroy
        blogposts = BlogPost.all
        @blogpost = BlogPost.find(params[:id])
        if @blogpost.destroy
---
SELECT "blog_posts".* FROM "blog_posts"
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 4]]