app/controllers/daily_entries_controller.rb

SELECT "daily_entries".* FROM "daily_entries"
---
  def index
    @dailyentries = DailyEntry.all

SELECT "daily_entries".* FROM "daily_entries" WHERE "daily_entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @dailyentry = DailyEntry.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "prompts".* FROM "prompts" WHERE "prompts"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
INSERT INTO "daily_entries" ("rating", "content", "user_id", "prompt_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 4], ["content", "yell at Mark"], ["user_id", 1], ["prompt_id", 16], ["created_at", "2020-11-28 00:30:35.142564"], ["updated_at", "2020-11-28 00:30:35.142564"]]
---
  def create
    # byebug
    user = User.find(params[:user_id])
    prompt = Prompt.find(params[:prompt_id])
    @dailyentry = DailyEntry.new(
      rating: params[:rating],
      content: params[:content],
      user: user,
      prompt: prompt
    )
  #  byebug
    if @dailyentry.save

SELECT "daily_entries".* FROM "daily_entries" WHERE "daily_entries"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "daily_entries" SET "rating" = $1, "content" = $2, "date" = $3, "updated_at" = $4 WHERE "daily_entries"."id" = $5  [["rating", 4], ["content", "cool"], ["date", nil], ["updated_at", "2020-12-03 06:24:53.153168"], ["id", 1]]
---
  def update
    @dailyentry = DailyEntry.find(params[:id])
    if @dailyentry
      @dailyentry.update(
      rating: params[:rating],
      content: params[:content])

SELECT "daily_entries".* FROM "daily_entries"
DELETE FROM "daily_entries" WHERE "daily_entries"."id" = $1  [["id", 5]]
---
  def destroy
    daileyentries = DailyEntry.all
    @dailyentry = find_daily_entries
    if @dailyentry.destroy

SELECT "daily_entries".* FROM "daily_entries" WHERE "daily_entries"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_daily_entries
    @dailyentry = DailyEntry.find(params[:id])