app/controllers/moods_controller.rb

SELECT "moods".* FROM "moods"
---
  def index
    render json: Mood.all.to_json()