app/controllers/prompts_controller.rb

SELECT "prompts".* FROM "prompts"
---
  def index
    render json: Prompt.all.to_json()