app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "goals".* FROM "goals" WHERE "goals"."name" = $1 LIMIT $2  [["name", "Increase Happiness"], ["LIMIT", 1]]
INSERT INTO "user_goals" ("user_id", "goal_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["goal_id", 1], ["created_at", "2020-11-24 03:08:04.440593"], ["updated_at", "2020-11-24 03:08:04.440593"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password]
    )
    if @user.save
      params[:goals].each do |k, v|
        goal = Goal.find_by(name: k)
        UserGoal.create(
          goal: goal,
          user: @user
        )